app/views/transaction/index.html.erb

SELECT "users".* FROM "users"
---
  Transaction username
  <%= f.select :transaction_user_id, User.all.map { |r| [r.name, r.id] } %></br>