app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("user_id", "amount", "currency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 6134], ["amount", "850.0"], ["currency", "uah"], ["created_at", "2018-06-21 19:42:32.911691"], ["updated_at", "2018-06-21 19:42:32.911691"]]
---
  def create
    @account = Account.new(
      user_id: current_user.id,
      currency: account_params[:currency],
      amount: account_params[:amount]
    )

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", "2500.0"], ["updated_at", "2018-06-22 12:40:09.527833"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)