app/controllers/deposit_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6134], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 6134]]
---
  def index
    @user = User.find_by_id(current_user.id)
    @account_cash = Account.where(user_id: current_user.id)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."currency" = $2  [["user_id", 6134], ["currency", "uah"]]
UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", "945.0"], ["updated_at", "2018-06-22 11:20:10.509073"], ["id", 13]]
---
  def create
    account_cash = Account.get_account_amount(current_user.id, deposit_params[:currency])
    account_cash.each do |a|
      @user_amount = a.amount
    end
    @user_amount += deposit_params[:deposit_sum].to_i
    account_cash.update(amount: @user_amount)