app/controllers/users_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 6134], ["LIMIT", 1]]
---
  def show
    @account_cash = Account.where(user_id: current_user.id)