app/controllers/withdraw_controller.rb

  def index
    @user = User.find_by_id(current_user.id)
    @account_cash = Account.where(user_id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6134], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 6134]]

  def create
    account_cash = Account.get_account_amount(
      current_user.id, withdraw_params[:currency]
    )
    account_cash.each do |a|
      @user_amount = a.amount
    end
    @user_amount -= withdraw_params[:withdraw_sum].to_i
    account_cash.update(amount: @user_amount)
---
UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", "830.0"], ["updated_at", "2018-06-22 08:07:51.445850"], ["id", 13]]